Repository: Zhortein/elastic-entity-bundle
Catalog: translations/zhortein_elastic_entity-manager+intl-icu.*.xliff
Languages: fr

# manager.no-metatadata-for-class
source: No metadata found for class: {className}
fr: Aucune métadonnée trouvée pour la classe : {className}

# manager.no-elastic-entity-attribute-for-class
source: No ElasticEntity attribute found for class: {className}
fr: Aucun attribut ElasticEntity trouvé pour la classe : {className}

# manager.invalid-identifier-for-class
source: The entity of class {className} does not have a valid ID and cannot be mapped.
fr: L'entité de la classe {className} n'a pas d'ID valide et ne peut pas être mappée.

# manager.entity-must-implement-interface
source: Entity {className} must implement ElasticEntityInterface.
fr: L'entité {className} doit implémenter ElasticEntityInterface.

# manager.entity-must-implement-valid-getid
source: Entity {className} must have a getId method that returns a non-null value. Ensure the "id" property is initialized.
fr: L'entité {className} doit avoir une méthode getId qui renvoie une valeur non nulle. Assurez-vous que la propriété "id" est initialisée.

# manager.invalid-field-for-entity
source: Entity {className} have an invalid field {fieldName}.
fr: L'entité {className} possède un champ invalide : {fieldName}.

# manager.invalid-sort-field-for-entity
source: Invalid sort field {fieldName} on Entity {className}.
fr: Champ de tri invalide {fieldName} sur l'entité {className}.

# manager.invalid-aggregation-response-format
source: Invalid aggregation response format.
fr: Format de réponse d'agrégation invalide.

# manager.invalid-nested-data-format
source: Invalid nested data format in Entity {className} for relation with {relatedClassName}.
fr: Format des données imbriquées invalide dans l'entité {className} pour la relation avec {relatedClassName}.

# manager.nested-data-format-error
source: Nested data must be an associative array with string keys in Entity {className} for relation with {relatedClassName}.
fr: Les données imbriquées doivent être un tableau associatif avec des clés de type chaîne dans l'entité {className} pour la relation avec {relatedClassName}.

# manager.field-not-nullable
source: Entity {className} : {fieldName} cannot be null.
fr: Entité {className} : {fieldName} ne peut pas être null.

# manager.custom-query.index-cannot-be-null
source: Index must be provided when no className is provided.
fr: L'index doit être fourni lorsque aucun nom de classe n'est spécifié.

# manager.custom-count-query.unexpected-response
source: Unexpected response format from Elasticsearch count query.
fr: Format de réponse inattendu pour la requête de comptage Elasticsearch.
